homework2/WeatherFromCity/build/client_WSDL.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="client_WSDL" targetNamespace="http://j2ee.netbeans.org/wsdl/WeatherFromCity/src/client_WSDL"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/WeatherFromCity/src/client_WSDL" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types/>
    <message name="client_WSDLOperationRequest">
        <part name="IP_Address" type="xsd:string"/>
    </message>
    <message name="client_WSDLOperationResponse">
        <part name="Current_Weather" type="xsd:string"/>
    </message>
    <portType name="client_WSDLPortType">
        <operation name="client_WSDLOperation">
            <input name="input1" message="tns:client_WSDLOperationRequest"/>
            <output name="output1" message="tns:client_WSDLOperationResponse"/>
        </operation>
    </portType>
    <binding name="client_WSDLBinding" type="tns:client_WSDLPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="client_WSDLOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/WeatherFromCity/src/client_WSDL"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/WeatherFromCity/src/client_WSDL"/>
            </output>
        </operation>
    </binding>
    <service name="client_WSDLService">
        <port name="client_WSDLPort" binding="tns:client_WSDLBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/client_WSDLService/client_WSDLPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="client_WSDL">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="client_WSDLPortTypeRole" portType="tns:client_WSDLPortType"/>
    </plnk:partnerLinkType>
</definitions>
