homework2/WeatherFromCityCA/test/TestPisa/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cli="http://j2ee.netbeans.org/wsdl/WeatherFromCity/src/client_WSDL">
  <soapenv:Body>
    <cli:client_WSDLOperation>
      <IP_Address>131.114.3.24</IP_Address>
    </cli:client_WSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>